[Jedi X2SoldierClassTemplate]
+DisplayName="Jedi"
+ClassSummary="The Jedi are the guardians of peace and justice in the Galactic Republic. Falling to the Dark Side of the Force many Jedi become Sith. The Sith are the ancient enemies of the Jedi Order and fought numerous wars with them for thousands of years."
+LeftAbilityTreeTitle="Light Side"
+RightAbilityTreeTitle="Dark Side"

+RankNames[0]=
+RankNames[1]=Initiate
+RankNames[2]=Padawan
+RankNames[3]=Knight
+RankNames[4]=Guardian
+RankNames[5]=Sentinel
+RankNames[6]=Consular
+RankNames[7]=Master
+RankNames[8]=Grand Master

+ShortNames[0]=
+ShortNames[1]=Initiate
+ShortNames[2]=Padawan
+ShortNames[3]=Knight
+ShortNames[4]=Guardian
+ShortNames[5]=Sentinel
+ShortNames[6]=Consular
+ShortNames[7]=Master
+ShortNames[8]=Grand Master


+RankIcons[0]=""
+RankIcons[1]="JediClassUI.Ranks.rank_Initiate"
+RankIcons[2]="JediClassUI.Ranks.rank_Padawan"
+RankIcons[3]="JediClassUI.Ranks.rank_Knight"
+RankIcons[4]="JediClassUI.Ranks.rank_Guardian"
+RankIcons[5]="JediClassUI.Ranks.rank_Sentinel"
+RankIcons[6]="JediClassUI.Ranks.rank_Consular"
+RankIcons[7]="JediClassUI.Ranks.rank_Master"
+RankIcons[8]="JediClassUI.Ranks.rank_GrandMaster"

+RandomNickNames[0]=""
+RandomNickNames[1]=""
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[14]=""

[ForceChoke X2AbilityTemplate]
LocFriendlyName="Force Choke"
LocFlyOverText="Force Choke"
LocLongDescription="Telekintec strangle the victim with this dark force power from afar."
LocHelpText="Telekintec strangle the victim with this dark force power from afar."
LocPromotionPopupText="<Bullet/>Telekintec strangle the victim with this dark force power from afar."

[ForceLightning X2AbilityTemplate]
LocFriendlyName="Force Lightning"
LocFlyOverText="Force Lightning"
LocLongDescription="Channel you hatred and anger and realease a devastating force lightning"
LocHelpText="Channel you hatred and anger and realease a devastating force lightning "
LocPromotionPopupText="<Bullet/>Cause damage on a succesful psi offense vs will contest<br /><Bullet/>Can also target civilians and squad mates. This shifts your force alignment to the dark side."

[ForceChainLightning X2AbilityTemplate]
LocFriendlyName="Chain Lightning"
LocFlyOverText="Chain Lightning"
LocLongDescription="Channel you hatred and anger and realease a devastating force lightning that hit multiple enemies"
LocHelpText="Channel you hatred and anger and realease a devastating force lightning that hit multiple enemies"
LocPromotionPopupText="<Bullet/>Causes damage to ever unit in sight which fails a psi offense vs will contest<br /><Bullet/>Can also target civilians and squad mates. This shifts your force alignment to the dark side."

[ForcePush X2AbilityTemplate]
LocFriendlyName="Force Push"
LocFlyOverText="Force Push"
LocLongDescription="Use the force to push a target away from you. This basic force power will always hit, can cancel overwatch, has a chance to stun the target and applies minimal damage"
LocHelpText="Use the force to push a target away from you. This basic force power will always hit, can cancel overwatch, has a chance to stun the target and applies minimal damage"
LocPromotionPopupText="<Bullet/>Can apply stun<br /><Bullet/>Cancel overwatch and viper bounds<br /><Bullet/>Does not end turn<br /><Bullet/>Guaranteed hit<br /><Bullet/><Ability:Cooldown< /> Cooldown<br />"

[ForceWind X2AbilityTemplate]
LocFriendlyName="Force Wind"
LocFlyOverText="Force Wind"
LocLongDescription="Use the force to push multiple targets away from you and cause environment devastation. This advanced force power will always hit, can cancel overwatch, has a chance to stun the target and applies some damage."
LocHelpText="Use the force to push multiple targets away from you and cause environment devastation. This advanced force power will always hit, can cancel overwatch, has a chance to stun the target and applies some damage."
LocPromotionPopupText="<Bullet/>Can apply stun<br /><Bullet/>Cancel overwatch and viper bounds<br /><Bullet/>Guaranteed hit<br /><Bullet/><Ability:Cooldown< /> Cooldown<br />"

[ForceJump X2AbilityTemplate]
LocFriendlyName="Force Jump"
LocFlyOverText="Force Jump"
LocLongDescription="The Jedi can jump incredible heights with the help of the force"
LocHelpText="The Jedi can jump incredible heights with the help of the force"
LocPromotionPopupText="<Bullet/>Allows to jump on buildings without a ladder or pipe"

[MindTricks X2AbilityTemplate]
LocFriendlyName="Jedi Mind Tricks"
LocFlyOverText="Jedi Mind Tricks"
LocLongDescription="Affect the mind of the weak reducing the move, sight and detection range to zero. This force power does not break concealment."
LocHelpText="Affect the mind of the weak reducing the move, sight and detection range to zero. This force power does not break concealment."
LocFlyOverText="Jedi Mind Trick"
LocMissMessage="Jedi Mind Trick Failed"
LocPromotionPopupText="<Bullet/>Cone AOE effect that reduces the move, sight and detection range to zero if successfull. The ability does not break concealment.<br /><Bullet/><Ability:Cooldown< /> Cooldown<br />"

[ForceHeal X2AbilityTemplate]
LocFriendlyName="Force Heal"
LocFlyOverText="Force Heal"
LocLongDescription="Heal allies or self with the force. Also removes negative status effects and revives bleeding out squadmates."
LocHelpText="Heal allies or self with the force. Also removes negative status effects and revives bleeding out squadmates."
LocPromotionPopupText="<Bullet/>Heals Units<br /><Bullet/>Heals target<br /><Bullet/>Removes negative status effects<br /><Bullet/>Recovers target from unconsciousness and bleeding out<br /><Bullet/>Using force heal on squad mates shifts your force alignment to the lightside<br />"

[MindControl X2AbilityTemplate]
LocFriendlyName="Mind Control"
LocFlyOverText="Mind Control"
LocLongDescription="Gain complete control over your friends and enemies."
LocHelpText="Gain complete control over your friends and enemies."
LocPromotionPopupText="<Bullet/>Gain complete control over your friends and enemies<Bullet/>Can also target civilians and squad mates. This shifts your force alignment to the dark side."

[ForceSpeed X2AbilityTemplate]
LocFriendlyName="Force Speed"
LocFlyOverText="Force Speed"
LocLongDescription="Take three actions this turn, and no action is turn-ending."
LocHelpText="Take three actions this turn, and no action is turn-ending."
LocPromotionPopupText="<Bullet/>Take three actions this turn, and no action is turn-ending.</br>"

[ForceFear X2AbilityTemplate]
LocFriendlyName="Force Fear"
LocFlyOverText="Force Fear"
LocLongDescription="The wielder strikes directly at the deepest parts of the target's mind, causing an uncontrollable shaking fear that wreak havoc with the target's capabilities. This power is so subtle that its use does not break concealment."
LocHelpText="The wielder strikes directly at the deepest parts of the target's mind, causing an uncontrollable shaking fear that wreak havoc with the target's capabilities. This power is so subtle that its use does not break concealment."
LocPromotionPopupText="<Bullet/>Cone AOE attack that may cause organic enemies to panic.</br><Bullet/>Does not break concealment.</br><Bullet/>Can also target civilians and squad mates. This shifts your force alignment to the dark side."

[LeapStrike X2AbilityTemplate]
LocFriendlyName="Leap Strike"
LocFlyOverText="Leap Strike"
LocLongDescription="The Jedi uses the force to leap to the target and immediately attack with the lightsaber without triggering reaction fire."
LocHelpText="The Jedi uses the force to leap to the target and immediately attack with the lightsaber without triggering reaction fire."
LocPromotionPopupText="<Bullet/>The Jedi uses the force to leap to the target and immediately attack with the lightsaber without triggering reaction fire.</br>"

[LightsaberSlash X2AbilityTemplate]
LocFriendlyName="Lightsaber Slash"
LocFlyOverText="Lightsaber Slash"
LocLongDescription="Attack an adjacent target with your Lightsaber. Uses one action."
LocHelpText="Attack an adjacent target with your Lightsaber. Uses one action."
LocPromotionPopupText="<Bullet/> Attack an adjacent target with your Lightsaber.<br/><Bullet/> Uses one action and doesn't automatically end your turn, so two attacks a turn are possible."

[EnergyAbsorption X2AbilityTemplate]
LocFriendlyName="Energy Absorption"
LocFlyOverText="Energy Absorption"
LocLongDescription="You are skilled at absorbing incoming energy with the force. You are granted 5 energy shield points."
LocHelpText="You are skilled at absorbing incoming energy with the force. You are granted 5 energy shield points."
LocPromotionPopupText="<Bullet/>You are granted 5 energy shield points.</br>"

[BattleMeditation X2AbilityTemplate]
LocFriendlyName="Battle Meditation"
LocFlyOverText="Battle Meditation"
LocLongDescription="When in the state of battle meditation the jedi is capable of of deflecting or reflecting every incoming shot."
LocHelpText="When in the state of battle meditation the jedi is capable of of deflecting or reflecting every incoming shot."
LocPromotionPopupText="<Bullet/>Unlimited reflections/deflections for one enemy turn</br>"

[MindControl X2AbilityTemplate]
LocFriendlyName="Mind Control"
LocLongDescription="Permanently mind control an enemy. Only one successful Domination can be performed per mission."
LocHelpText="Permanently mind control an enemy. Only one successful Domination can be performed per mission."
LocFlyOverText="Mind Control"
LocMissMessage="Mind Control Failed"
LocPromotionPopupText="<Bullet/> Domination requires a contest of the Psi Operative's Psi Strength stat versus the Will of the target.<br/><Bullet/> If an attempted Domination fails, there is a 4 turn coldown before another Domination can be attempted.<br/><Bullet/> If the Psi Operative dies or leaves the battlefield, the Domination is broken.<br/>"

[ForceSense X2AbilityTemplate]
LocFriendlyName="Force Sense"
LocLongDescription="Sense nearby units even without line of sight. Force sense will reveal concealed and burrowed enemies."
LocHelpText="Sense nearby units even without line of sight. Force sense will reveal concealed and burrowed enemies."
LocFlyOverText="Force Sense"
LocPromotionPopupText="<Bullet/>Sense enemies outside normal visual range.<br/><Bullet/> Force sense will reveal concealed and burrowed enemies.<br/>"

[ForceProtection X2AbilityTemplate]
LocFriendlyName="Force Protection"
LocLongDescription="A power only achieved by high-rank Jedi, Force Protection made the bearer invulnerable to a wide range of attacks. The Jedi is immune to fire, poison, acid, and explosive damage."
LocHelpText="The Jedi is immune to fire, poison, acid, and explosive damage."
LocFlyOverText="Force Protection"
LocPromotionPopupText="<Bullet/>A Jedi with the Force Protection ability can walk through fire, poison and acid with no ill effects.<br/>"

[Slash_LW X2AbilityTemplate]
LocFriendlyName="Slash"
LocFlyOverText="Slash"
LocLongDescription="Attack an adjacent target with your sword. Uses one action."
LocHelpText="Attack an adjacent target with your sword. Uses one action."
LocPromotionPopupText="<Bullet/>Attack an adjacent target with your sword.<br/><Bullet/> Uses one action and doesn't automatically end your turn, so two attacks a turn are possible."

[ForceDrain X2AbilityTemplate]
LocFriendlyName="Force Drain"
LocFlyOverText="Force Drain"
LocLongDescription="Drain the life of targets around you to heal yourself."
LocHelpText="Drain the life of targets around you to heal yourself."
LocPromotionPopupText="<Bullet/>AOE effect around you<br /><Bullet/>Heal a hit point for every point of damage you cause."
